{"resource_id":"feat","stats":{"name":{"value":"Ritual Caster"},"source":{"value":"phb"},"prerequisites":{"value":"Intelligence or Wisdom 13 or higher"},"descriptions":{"value":[{"resource_id":"levelled_description","stats":{"description":{"value":"You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.\n\nWhen you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: bard, cleric, druid, sorcerer, warlock, or wizard. You must choose your spells from that class's spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.\n\nIf you come across a spell in written form, such as a magical spell scroll or a wizard's spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it"},"updated_at":{"value":"2024-12-20T18:50:28.397708"},"id":"f58aa195-53aa-4cab-8e04-c99ae5c9c199"}}]},"effects":{"value":[{"resource_id":"levelled_effect","stats":{"effect":{"value":{"resource_id":"effect","stats":{"name":{"value":"Get Ritual Book"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"c9da927c-2cc0-408b-a1e4-ec5677ea622b"}}},"id":"e213b531-69cc-440a-84b7-1089a871c45c"}}},"id":"fe07bb93-1c6e-4e57-bfa2-98887c59d3e0"}}]},"updated_at":{"value":"2024-12-20T18:50:28.397713"},"id":"ritual_caster"}}