{"resource_id":"feat","stats":{"name":{"value":"Strike of the Giants"},"source":{"value":"bgg"},"prerequisites":{"value":"Martial Proficiency or Giant Foundling"},"descriptions":{"value":[{"resource_id":"levelled_description","stats":{"description":{"value":"You have absorbed primeval magic that gives you an echo of the might of giants. When you take this feat, choose one of the benefits listed below. Once per turn, when you hit a target with a melee weapon attack or a ranged weapon attack using a thrown weapon, you can imbue the attack with an additional effect depending on the benefit you chose:\n\n- Cloud Strike: The target takes an extra 1d4 thunder damage. If the target is a creature, it must succeed on a Wisdom saving throw, or you become invisible to it until the start of your next turn or until immediately after you make an attack roll or cast a spell.\n\n- Fire Strike: The target takes an extra 1d10 fire damage.\n\n- Frost Strike: The target takes an extra 1d6 cold damage. If the target is a creature, it must succeed on a Constitution saving throw, or its speed is reduced to 0 until the start of your next turn.\n\n- Hill Strike: The target takes an extra 1d6 damage of the weapon's type. If the target is a creature, it must succeed on a Strength saving throw or have the prone condition.\n\n- Stone Strike: The target takes an extra 1d6 force damage. If the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet from you in a straight line\n\n- Storm Strike: The target takes an extra 1d6 lightning damage. If the target is a creature, it must succeed on a Constitution saving throw, or it has disadvantage on attack rolls until the start of your next turn.\nThe saving throw DC for these effects equals 8 + your proficiency bonus + your Strength or Constitution modifier.\n\nYou can use this feat a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest"},"updated_at":{"value":"2024-12-20T18:50:28.389549"},"id":"0e7ac1a8-a284-4da3-81e5-e4efba717db0"}}]},"effects":{"value":[{"resource_id":"levelled_effect","stats":{"effect":{"value":{"resource_id":"effect","stats":{"name":{"value":"Imbue Thrown Weapon"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"908583b8-8f92-4569-b091-8e6cb17a3861"}}},"has_charges":{"value":true},"charge_type":{"value":"calculated"},"max_charges_levelled_formulas":{"value":[{"resource_id":"levelled_value_calculator","stats":{"calculators":{"value":[{"resource_id":"value_calculator","stats":{"operands":{"value":[{"resource_id":"operand","stats":{"stat":{"value":"$character.proficiency_bonus"},"id":"24731301-544e-4730-841c-b8474bad416f"}}]},"id":"d1e503b5-d71d-4371-9675-1efdbc68acd6"}}]},"id":"748f118b-cc5e-4a04-bfc6-66575209a552"}}]},"id":"75862abf-15fb-4244-8428-16c61bd31f1b"}}},"id":"5d78d5eb-d232-4b4a-addd-8bc3b61f6fc4"}}]},"updated_at":{"value":"2024-12-20T18:50:28.389556"},"id":"strike_of_the_giants__bgg_"}}