{"resource_id":"feat","stats":{"name":{"value":"Quicksmithing"},"source":{"value":"psk"},"prerequisites":{"value":"Intelligence 13 or higher"},"descriptions":{"value":[{"resource_id":"levelled_description","stats":{"description":{"value":"You have mastered the art of on-the-fly invention, improvement, and jury-rigging. You can use your talents to create immediate, short-term magical effects similar to spells, given time and an adequate supply of aether.\n\nWhen you choose this feat, you master two magical effects, each of which recreates the effect of a 1st-level spell that has the ritual tag. These spells can come from any class list, but Intelligence is your spellcasting ability for them.\n\nIf you come across a schematic geared toward quicksmithing or study with another quicksmith, you might be able to add another spell to the effects you have mastered. The spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of mastering the spell takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents aether you use as you experiment with the spell effect to master it.\n\nIn addition, you have proficiency with artisan's tools (quicksmith's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours unless you spend 1 hour repairing it to keep it functioning. You can use your action to dismantle the device, at which point you can reclaim the materials used to create it. You can have up to three such devices active at a time.\n\nWhen you create a device, choose one of the following options:\n\n- Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction\n\n- Fire Starter. This device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n\n- Music Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed"},"updated_at":{"value":"2024-12-20T18:50:28.401726"},"id":"8f179767-5cda-46e5-829b-c5b82345f3c4"}}]},"effects":{"value":[{"resource_id":"levelled_effect","stats":{"effect":{"value":{"resource_id":"effect","stats":{"name":{"value":"Master 2 Magical Effects"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"12d900de-7cbe-4c5c-92a2-d74a3629714c"}}},"id":"944fb8be-7516-43f8-aac0-ef9aa18555da"}}},"id":"e583d8a7-2237-468c-a35e-1b0f6ac63c61"}},{"resource_id":"levelled_effect","stats":{"effect":{"value":{"resource_id":"effect","stats":{"name":{"value":"Artisan's Tools Proficiency"},"trigger_condition":{"value":{"resource_id":"trigger_condition_or","stats":{"id":"77289c8c-471a-48b9-8a8d-2a639e8eef3f"}}},"id":"1f44b424-ec64-42e1-9b21-5f6b8304079c"}}},"id":"66665158-e152-4d26-a52e-69bbe3c6bd78"}}]},"updated_at":{"value":"2024-12-20T18:50:28.401729"},"id":"quicksmithing"}}