{"resource_id":"spell","stats":{"name":{"value":"Illusory Dragon"},"source":{"value":"xge"},"level":{"value":"spell_level_8"},"school":{"value":"spell_school_illusion"},"casting_time":{"value":"1 action"},"range":{"value":"120 feet"},"duration":{"value":"Concentration, up to 1 minute"},"somatic":{"value":true},"description":{"value":"By gathering threads of shadow material from the Shadowfell, you create a Huge shadowy dragon in an unoccupied space that you can see within range. The illusion lasts for the spell’s duration and occupies its space, as if it were a creature.\nWhen the illusion appears, any of your enemies that can see it must succeed on a Wisdom saving throw or become frightened of it for 1 minute. If a frightened creature ends its turn in a location where it doesn’t have line of sight to the illusion, it can repeat the saving throw, ending the effect on itself on a success.\nAs a bonus action on your turn, you can move the illusion up to 60 feet. At any point during its movement, you can cause it to exhale a blast of energy in a 60-foot cone originating from its space. When you create the dragon, choose a damage type: acid, cold, fire, lightning, necrotic, or poison. Each creature in the cone must make an Intelligence saving throw, taking '7d6 damage of the\nchosen damage type on a failed save, or half as much damage on a successful one.\nThe illusion is tangible because of the shadow stuff used to create it, but attacks miss it automatically. it succeeds on all saving throws, and it is immune to all damage and conditions. A creature that uses an action to examine the dragon can determine that it is an illusion by succeeding on an Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through it and has advantage on saving throws against its breath"},"classes":{"value":["wizard"]},"dice":{"value":[{"resource_id":"levelled_damage_dice","stats":{"level":{"value":8},"damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":7},"dice_type":{"value":"d6"},"updated_at":{"value":"2024-12-20T18:50:46.693863"},"id":"a9f3a6c2-4196-42a4-9488-88f0991274da"}}]},"damage_type":{"value":"magic"},"updated_at":{"value":"2024-12-20T18:50:46.693868"},"id":"d2d004b4-e0b8-496f-bbc2-adf1eae9d9f4"}}]},"updated_at":{"value":"2024-12-20T18:50:46.693872"},"id":"c8f1d66a-1089-43ed-9aef-21f2962f001c"}}]},"updated_at":{"value":"2024-12-20T18:50:46.693875"},"id":"illusory_dragon"}}