{"resource_id":"spell","stats":{"id":"whirlwind","name":{"value":"Whirlwind"},"source":{"value":"xge"},"level":{"value":"spell_level_7"},"school":{"value":"spell_school_evocation"},"ritual":{"value":false},"casting_time":{"value":"1 action"},"range":{"value":"300 feet"},"duration":{"value":"Concentration, up to 1 minute"},"verbal":{"value":true},"somatic":{"value":false},"material":{"value":true},"components":{"value":"a piece of straw"},"description":{"value":"A whirlwind howls down to a point on the ground you specify. The whirlwind is a 10-foot-radius, 30-foot-high cylinder centered on that point. Until the spell ends, you can use your action to move the whirlwind up to 30 feet in any direction along the ground. The whirlwind sucks up any Medium or smaller objects that aren’t secured to anything and that aren’t worn or carried by anyone.\n\nA creature must make a Dexterity saving throw the first time on a turn that it enters the whirlwind or that the whirlwind enters its space, including when the whirlwind first appears. A creature takes 10d6 bludgeoning damage on a failed save, or half as much damage on a successful one. In addition, a Large or smaller creature that fails the save must succeed on a Strength saving throw or become restrained in the whirlwind until the spell ends. When a creature starts its turn restrained by the whirlwind, the creature is pulled 5 feet higher inside it, unless the creature is at the top. A restrained creature moves with the whirlwind and falls when the spell ends, unless the creature has some means to stay aloft.\n\nA restrained creature can use an action to make a Strength or Dexterity check against your spell save DC. If successful, the creature is no longer restrained by the whirlwind and is hurled 3d6 × 10 feet away from it in a random direction."},"classes":{"value":["druid","fighter","rogue","wizard"]},"dice":{"value":[{"resource_id":"levelled_damage_dice","stats":{"level":{"value":7},"damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":10},"dice_type":{"value":"d6"},"constant":{"value":0},"id":"0a27183a-50ca-4bc9-a12c-49a22b1217c6","updated_at":{"value":"2024-12-20T18:50:46.673117"}}}]},"damage_type":{"value":"bludgeoning"},"id":"5c11f415-d4f6-4696-af47-39a83c999e47","updated_at":{"value":"2024-12-20T18:50:46.673122"}}}]},"id":"7256a241-c4d2-43a0-a8bd-d38dc9cced41","updated_at":{"value":"2024-12-20T18:50:46.673127"}}}]},"updated_at":{"value":"2024-12-20T18:50:46.673129"}}}