{"resource_id":"spell","stats":{"id":"bones_of_the_earth","name":{"value":"Bones of the Earth"},"source":{"value":"xge"},"level":{"value":"spell_level_6"},"school":{"value":"spell_school_transmutation"},"ritual":{"value":false},"casting_time":{"value":"1 action"},"range":{"value":"120 feet"},"duration":{"value":"Instantaneous"},"verbal":{"value":true},"somatic":{"value":true},"material":{"value":false},"description":{"value":"You cause up to six pillars of stone to burst from places on the ground that you can see within range. Each pillar is a cylinder that has a diameter of 5 feet and a height of up to 30 feet. The ground where a pillar appears must be wide enough for its diameter, and you can target ground under a creature if that creature is Medium or smaller. Each pillar has AC 5 and 30 hit points. When reduced to 0 hit points, a pillar crumbles into rubble, which creates an area of difficult terrain with a 10-foot radius. The rubble lasts until cleared.\n\nIf a pillar is created under a creature, that creature must succeed on a Dexterity saving throw or be lifted by the pillar. A creature can choose to fail the save.\n\nIf a pillar is prevented from reaching its full height because of a ceiling or other obstacle, a creature on the pillar takes 6d6 bludgeoning damage and is restrained, pinched between the pillar and the obstacle. The restrained creature can use an action to make a Strength or Dexterity check (the creature’s choice) against the spell’s saving throw DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it."},"higher_level_description":{"value":"When you cast this spell using a spell slot of 7th level or higher, you can create two additional pillars for each slot level above 6th."},"classes":{"value":["druid"]},"dice":{"value":[{"resource_id":"levelled_damage_dice","stats":{"level":{"value":6},"damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":6},"dice_type":{"value":"d6"},"constant":{"value":0},"id":"7cb36b77-693a-470b-9cbb-108da60ea4ce","updated_at":{"value":"2024-12-20T18:50:46.670316"}}}]},"damage_type":{"value":"bludgeoning"},"id":"31f046b3-52b0-4f8e-a5c7-4157a5076293","updated_at":{"value":"2024-12-20T18:50:46.670321"}}}]},"id":"2dd71aaf-07ca-4b9f-b711-fd7520899116","updated_at":{"value":"2024-12-20T18:50:46.670326"}}}]},"updated_at":{"value":"2024-12-20T18:50:46.670330"}}}