{"resource_id":"spell","stats":{"name":{"value":"Dark Star"},"source":{"value":"egw"},"level":{"value":"spell_level_8"},"school":{"value":"spell_school_evocation"},"casting_time":{"value":"1 action"},"range":{"value":"150 feet"},"duration":{"value":"1 minute"},"verbal":{"value":true},"somatic":{"value":true},"material":{"value":true},"components":{"value":"a shard of onyx and a drop of the caster's blood, both of which the spell consumes"},"description":{"value":"This spell creates a sphere centered on a point you choose within range. The sphere can have a radius of up to 40 feet. The area within this sphere is filled with magical darkness and crushing gravitational force.\n\nFor the duration, the spell's area is difficult terrain. A creature with darkvision can't see through the magical darkness, and nonmagical light can't illuminate it. No sound can be created within or pass through the area. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there.\n\nAny creature that enters the spell's area for the first time on a turn or starts its turn there must make a Constitution saving throw. The creature takes 8d10 force damage on a failed save, or half as much damage on a successful one. A creature reduced to 0 hit points by this damage is disintegrated. A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust."},"classes":{"value":["wizard"]},"dice":{"value":[{"resource_id":"levelled_damage_dice","stats":{"level":{"value":8},"damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":8},"dice_type":{"value":"d10"},"updated_at":{"value":"2024-12-20T18:50:46.699012"},"id":"36bb7d0f-ca67-4378-ba48-655cda29f1c5"}}]},"damage_type":{"value":"force"},"updated_at":{"value":"2024-12-20T18:50:46.699017"},"id":"0232bb8c-744d-4c33-a890-3255ed8d2c98"}}]},"updated_at":{"value":"2024-12-20T18:50:46.699021"},"id":"5dff0235-b1a4-49ee-a75e-f775ca678d33"}}]},"updated_at":{"value":"2024-12-20T18:50:46.699024"},"id":"dark_star"}}