{"resource_id":"spell","stats":{"id":"control_water","name":{"value":"Control Water"},"source":{"value":"phb"},"level":{"value":"spell_level_4"},"school":{"value":"spell_school_transmutation"},"ritual":{"value":false},"casting_time":{"value":"1 action"},"range":{"value":"300 feet"},"duration":{"value":"Concentration, up to 10 minutes"},"verbal":{"value":true},"somatic":{"value":true},"material":{"value":true},"components":{"value":"a drop of water and a pinch of dust"},"description":{"value":"Until the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one.\n\nIf you choose an area in a large body of water, you can instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller vehicles in the wave's path are carried with it to the other side. Any Huge or smaller vehicles struck by the wave have a 25 percent chance of capsizing.\n\nThe water level remains elevated until the spell ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts.\n\nWhen a creature enters the vortex for the first time on a turn, or starts its turn there, it must make a Strength saving throw. On a failed save, the creature takes 2d8 bludgeoning damage and is caught in the vortex until the spell ends. On a successful save, the creature takes half damage, and isn't caught in the vortex. A creature caught in the vortex can use its action to try and swim away from the vortex as described above, but has disadvantage on the Strength (Athletics) check to do so.\n\nThe first time each turn that an object enters the vortex, the object takes 2d8 bludgeoning damage; this damage occurs each round it remains in the vortex."},"classes":{"value":["cleric","druid","fighter","rogue","wizard"]},"dice":{"value":[{"resource_id":"levelled_damage_dice","stats":{"level":{"value":4},"damage_dice":{"value":[{"resource_id":"damage_dice","stats":{"dices":{"value":[{"resource_id":"dice_roll","stats":{"dice_amount":{"value":2},"dice_type":{"value":"d8"},"constant":{"value":0},"id":"c93acae5-3e60-40c0-b37d-7e658652c668","updated_at":{"value":"2024-12-20T18:50:46.636515"}}}]},"damage_type":{"value":"bludgeoning"},"id":"f3c0f0f3-03f0-4fdf-a95f-bbedb0c40876","updated_at":{"value":"2024-12-20T18:50:46.636522"}}}]},"id":"6d93ba47-6a69-4b47-a8a1-473c938ca99e","updated_at":{"value":"2024-12-20T18:50:46.636527"}}}]},"updated_at":{"value":"2024-12-20T18:50:46.636530"}}}