{"resource_id":"spell","stats":{"id":"teleport","name":{"value":"Teleport"},"source":{"value":"phb"},"level":{"value":"spell_level_7"},"school":{"value":"spell_school_conjuration"},"ritual":{"value":false},"casting_time":{"value":"1 action"},"range":{"value":"10 feet"},"duration":{"value":"Instantaneous"},"verbal":{"value":true},"somatic":{"value":false},"material":{"value":false},"description":{"value":"This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object, that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can't be held or carried by an unwilling creature.\n\nThe destination you choose must be known to you, and it must be on the same plane of existence as you. Your familiarity with the destination determines whether you arrive there successfully. The GM rolls d100 and consults the table.\n\n| Familiarity       | Mishap | Simliar Area | Off Target | On Target |\n\n|-------------------|--------|--------------|------------|-----------|\n\n| Permanent circle  |  ---   |      ---     |     ---    |   01-100  |\n\n| Associated object |  ---   |      ---     |     ---    |   01-100  |\n\n| Very familiar     | 01-05  |     06-13    |    14-24   |   25-100  |\n\n| Seen casually     | 01-33  |     34-43    |    44-53   |   54-100  |\n\n| Viewed once       | 01-43  |     44-53    |    54-73   |   74-100  |\n\n| Description       | 01-43  |     44-53    |    54-73   |   74-100  |\n\n| False destination | 01-50  |    51-100    |     ---    |    ---    |\n\n\"Very familiar\" is a place you have been very often, a place you have carefully studied, or a place you can see when you cast the spell. \"Seen casually\" is someplace you have seen more than once but with which you aren't very familiar. \"Viewed once\" is a place you have seen once, possibly using magic. \"Description\" is a place whose location and appearance you know through someone else's description, perhaps from a map.\n\n\"False destination\" is a place that doesn't exist. Perhaps you tried to scry an enemy's sanctum but instead view an illusion, or you were attempting to teleport to a familiar location that no longer exists."},"classes":{"value":["bard","sorcerer","fighter","rogue","wizard"]},"dice":{"value":[]},"updated_at":{"value":"2024-12-20T18:50:46.646218"}}}